window.addEventListener("load", () => {
  function getRandomInt(min, max) {
    min = Math.ceil(min);
    max = Math.floor(max);
    return Math.floor(Math.random() * (max - min) + min); // The maximum is exclusive and the minimum is inclusive
  }
  const container = document.getElementById("container");
  const chars = ["沅","沄","沞","沢","汥","沚","波","泍","泌","泊","泺","泼","沾","泟","沱","治","泜","泏","泹","沲","泽","沷","法","沸","泭","泔","沽","泒","河","泓","泘","沬","泋","泇","沮","浅","泾","泂","泃","泦","泫","泬","況","泪","沴","泣","泠","泖","泷","泸","沵","泯","沫","泥","泞","泮","泡","泙","泅","泧","泩","沭","泀","泗","泝","沺","沰","泄","泻","沿","泱","沶","泆","泳","油","泑","泎","沼","泈","注","洝","浇","派","测","浐","洆","浈","泚","洒","洮","涎","洞","洏","洱","洑","洸","洼","浑","活","洽","洚","洪","洉","浒","洹","洃","洄","浍","洁","洎","济","浃","洊","津","浕","浄","洘","洭","浌","洡","洌","浏","洛","洣","洺","洦","洠","浓","洀","洴","浀","洤","洳","洓","浉","洙","洬","洟","涏","洈","洧","洿","洗","洋","洨","洩","洐","洶","洫","洵","浔","洇","洂","洢","浂","泿","洕","洅","洔","洷","洲","浊","㳠","浜","浡","涔","浾","浺","涌","浱","浚","浟","涤","涉","浢","涜","涐","淓","浲","浮","浩","浭","浣","涡","海","浛","浫","涆","涥","浤","涣","浹","涧","浸","涇","浻","酒","涓","涃","涞","浨","浪","浶","涝","涙","浬","浰","涖","涊","涟","浖","流","浝","浼","涅","浿","涄","浦","浗","润","涩","涁","涑","涗","涚","洍","涘","浽","涛","涕","浵","涂","涋","涒","浘","涠","洖","浯","浠","涀","消","涍","浥","浳","浧","浴","涢","涨","浙","淽","浞","湴","渀","淲","淿","淺","渐","淌","淐","淨","淔","淑","淳","涰","淖","淙","淬","淡","淂","淀","渉","涷","渎","淝","渄","涪","涻","淦","渮","淈","涫","淪","混","淉","渦","涵","淊","涸","淏","鸿","淴","淮","涽","済","湕","涺","淗","渠","淃","渇","涳","淶","淚","淰","涼","淋","淩","淕","淥","渌","渵","淧","渑","淣","渒","淠","淎","淜","淇","淒","淁","渗","淸","清","淭","渃","渋","深","渖","液","涭","涮","淞","涾","淘","淟","添","涶","涴","渂","涹","淅","渓","淆","涬","淢","涯","淫","淹","渏","渶","淤","淯","渔","渁","渆","渊","渕","涱","淛","淍","渚","涿","淄","渍","溾","湃","湢","渤","溊","湌","測","湹","湛","湞","湁","滁","湷","湻","滋","湊","溚","渧","渫","湩","渡","湂","渳","渢","湗","溄","溉","港","滑","湀","溈","渾","溌","渴","渱","渹","湖","渙","湟","湏","湣","湱","湒","減","湔","溅","湫","湝","湨","溃","溂","湅","湸","游","湰","溇","満","渼","湄","湈","湎","渺","湐","渿","湳","湼","渜","渥","湓","湆","湇","湿","溬","渞","湭","湶","渘","渪","溞","湯","溲","渻","湦","湜","湤","湠","湉","渟","湥","湍","湪","湾","渨","渭","湋","温","湺","湘","湑","溆","渲","渰","渷","湮","湙","湚","溁","溋","湧","湵","湡","淵","湲","渽","渣","溠","滞","湽","渝","溰","滶","滗","滭","滨","溥","溨","滄","溭","溗","滀","滣","滌","滇","漨","滏","溝","滜","滆","滒","溎","滚","滈","澕","滉","滙","溷","漷","滘","滐","溍","溘","滥","漣","溧","漓","溓","溜","滝","滤","滦","溣","溤","满","漭","溕","溟","滅","漠","溺","溿","滂","溪","溼","滊","溱","溶","溽","滠","溡","溮","溯","滫","溸","溹","滖","溑","溻","溙","滩","溏","滔","溛","溦","溫","滃","溩","溴","潃","滛","滟","溔","滧","溢","溵","滢","滪","源","溒","溳","滍","準","滓","澚","滮","漂","漕","滻","漸","漅","滯","漴","漺","漘","漎","漗","潀","漼","潒","滴","滺","滼","漑","漧","澉","潅","潢","滾","漍","濄","漢","潂","滬","滸","滹","漶","漃","漈","滰","漖","漌","漮","滱","潉","漤","漯","潋","漻","滲","漋","漊","漏","滷","漉","滿","漫","滵","漞","漚","漰","潎","漆","漬","滽","滳","漡","漱","潄","漟","漛","潳","漙","漥","潍","漇","漝","潇","漵","潊","漩","漄","演","漹","漾","漜","漪","潩","潆","漁","漲","漳","潌","潴","潈","澆","澳","潷","潑","潘","潹","潺","潮","澈","澂","澄","潼","潨","澊","潬","潭","潪","濎","潡","濆","澓","澒","潙","澏","澔","潶","澋","澅","潓","潗","濈","澗","潐","潔","潏","潰","澜","潦","澇","潾","澑","澛","澫","澠","潣","澝","潖","澎","潽","潛","潜","漒","潤","潵","澁","潸","澘","潲","潻","澍","澌","濍","潥","澻","潠","澾","漽","潫","潿","潕","潝","潟","澙","澖","潯","潱","澐","潧","濐","濭","濒","澯","濸","澡","澶","濋","澬","濨","澸","澹","澢","澱","澤","澣","澮","濩","澴","濊","激","瀄","濅","澽","濑","澧","澰","濂","濓","澟","澪","潞","澷","濛","濗","濃","澼","澿","濇","濏","澨","濖","潚","濉","澥","澲","澺","澭","澞","澦","澵","濁","濞","濱","濵","濹","濤","濢","濧","濻","濡","濲","濠","濟","濫","濜","濪","瀞","濬","濶","濿","濔","瀎","濘","濮","濕","濝","澀","濯","瀡","瀇","濰","濣","濦","濴","瀁","濥","濙","濚","瀑","瀌","濼","瀍","瀋","瀓","濽","瀆","瀔","瀈","濺","瀐","瀅","瀏","瀂","濾","瀊","瀒","瀃","瀢","瀉","瀀","瀦","瀕","瀩","瀚","瀥","瀫","瀤","瀖","瀳","瀨","瀬","瀝","瀮","瀘","濳","瀙","瀜","瀭","瀗","瀟","瀣","瀛","瀠","瀯","瀺","瀻","瀿","瀵","灌","瀱","瀸","瀽","灂","瀾","灆","瀲","瀶","瀧","瀰","瀼","灀","瀹","瀷","瀴","灁","灇","灋","灃","灏","灍","灅","灕","灄","灊","灈","灐","灉","灘","灑","灖","灗","灔","灒","灛","灙","灚","灡","灜","灞","灝","灠","灟","灢","灣","灤","灦","灎","灨","灧","灩","灪"];
  let elems = [];
  let interval;
  let index = 0;

  function clearIntervals() {
    clearInterval(interval);
    elems.forEach((el) => clearInterval(el.elemInterval));
  }

  function createChar() {
    if (index >= chars.length) return clearInterval(interval);
    const elem = document.createElement("p");
    elem.innerHTML = chars[index];
    container.appendChild(elem);
    elem.style.left = getRandomInt(0, window.innerWidth)+"px";
    elem.style.top = "0px";
    let elemInterval = setInterval(() => {
      let hh = (+elem.style.top.split("px")[0]);
      if (hh >= window.innerHeight) clearInterval(elems[index].elemInterval);
      elem.style.top = hh+1+"px";
      elem.style.left = (+elem.style.left.split("px")[0])+(Math.random()>0.4?1:-1)+"px";
    }, 25);
    elems.push({elem,elemInterval});
    index++;
  }
  interval = setInterval(() => setTimeout(createChar, getRandomInt(15,90)*150), 25);
});